module.exports = {
config: {
name: "magi",
    aliases: ["Magi"],
version: "1.0",
author: "Munna",
role: 2,
category: "funny",
    shortDescription: "magi",
longDescription: "",
guide: {
vi: "not Available",
en: "{p} chik"
} 
},

  onStart: async function ({ api, event, userData, args }) {
      var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("রাস্তার পতিতা মাগী কে @ম্যানশন করুন", event.threadID);
let name =  event.mentions[mention];
    var arraytag = []; 
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("๛➣𓆩𝗠𝘂𝗻𝗻𝗮‣𒁍 এর চুদা লো");
setTimeout(() => {a({body: "খানকি মাগি 😋🥒তোর মার ভোদা  নাকি কালা🥱___♪তোরে আমার লাগে ভালা 🥵🥰" + " " + name, mentions: arraytag})}, 2000);
setTimeout(() => {a({body: "নাউজুবিল্লা দিয়া করলাম শুরু তোর মার পুটকিতে ডুকামু ২টা গরু 🤤💦।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "খানকি‌ মাগী তোর মাইরে ডগী স্টাইলে চুদি 😹" + " " + name, mentions: arraytag})}, 4000);
setTimeout(() => {a({body: "কুত্তার বাচ্ছা তর ভোদায় মাগুর মাছ চাষ করুম।😍." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "খাংকির মেয়ে তর কচি বোন রে চুদি 😍.." + " " + name, mentions: arraytag})}, 6000);
setTimeout(() => {a({body: "আমি তোর বাপ ๛➣𓆩𝗠𝘂𝗻𝗻𝗮‣𒁍 যেইখানে দেখবি সেইখানে দিবি সালাম🫡👹 🐰" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: " খানকী মাগী তর   হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট।🥱" + " " + name, mentions: arraytag})}, 8000);
setTimeout(() => {a({body: "পতিতা মাগী যা তোর ভুদায় পাউডার দে কি গন্ধ 😹" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "Hi ๛➣𓆩𝗠𝘂𝗻𝗻𝗮‣𒁍 এর জারজ মাইয়া" + " " + name, mentions: arraytag})}, 10000);
setTimeout(() => {a({body: "এ খানকি মাগি তোর মাইরে চুদি খাটের নিচে ফেলে 🥳" + " " + name, mentions: arraytag})}, 11000);
setTimeout(() => {a({body: "খান্কি মাগির মাইয়া  তর  ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু🤫" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "খাংকি মাগির মাইয়া  কথা ক কম কম তরে রে চুদে বানামু আইটেম বোম 😹" + " " + name, mentions: arraytag})}, 13000);
setTimeout(() => {a({body: "ইটখলায় ইট নাকি লাল তর মায়ের ভুদায় চুদে করবো লাল 🥱" + " " + name, mentions: arraytag})}, 14000);
setTimeout(() => {a({body: "রাস্তার মাগী তর ভুদার গন্ধে থাকা যাচ্ছে না 🤮।🥱" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "DNA টেষ্ট করা দেখবি  ๛➣𓆩𝗦𝗜𝗔𝗠,𝗠𝗨𝗡𝗡𝗔,𝗡𝗔𝗝𝗠𝗨𝗟,𝗥𝗔𝗧𝗨𝗟 এর চুদা তেই তর জন্ম 🥱" + " " + name, mentions: arraytag})}, 16000);
setTimeout(() => {a({body: "যামু সুন্দর বন 😁 নিয়া আমু হাতির ধন 😁🤤" + " আইনা তর মারে দিবো কঠিন চোদন 💦🤤" + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "হাতি চোদে দাড়াইয়া,বানর চোদে ডালে, ডেইলি রাইতে তর মারে চুদি আমি খালে 🤤💦" + " " + name, mentions: arraytag})}, 18000);
setTimeout(() => {a({body: "depression থেকেও তুমাকে কুত্তা দিয়ে   চু*** দি ☺" + " " + name, mentions: arraytag})}, 19000);
setTimeout(() => {a({body: "তরে হাতি দিযে চুদামু রাস্তার পতিতা  😹" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "কিরে পতিতা মাগী তোর ভোদায় নাকি অনেক গন্ধ🐸👿" + " " + name, mentions: arraytag})}, 21000);
setTimeout(() => {a({body:"তর ১ ট্যাং উচা করে চুদি 😍.."+ " " + name, mentions: arraytag})}, 22000);
setTimeout(() => {a({body: "১২ চোদা মাগীর মেয়ে তর কালো ভুদায় থু ✋" + " " + name, mentions: arraytag})}, 23000);
setTimeout(() => {a({body: "তোর মাইরে দিনে রাতে ২৪ ঘন্টা চুদি আর চুদি 😹" + " " + name, mentions: arraytag})}, 24000);
setTimeout(() => {a({body: "~ চুদা কি আরো খাবি মাগির মেয়ে 🥱" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body:"তোর আম্মুরে দিনে রাইতে চুদি খনিকের মেয়ে "+ " " + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body:"তর ভুদায় যখন ধন ডুকামু তখন চিল্লাইতে চিল্লাইতে মরবি😹"+ " " + name, mentions: arraytag})}, 27000);
setTimeout(() => {a({body:"তোকে উল্টো করে ঝুলিয়ে চুদি 💦"+ " " + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body:"তর কচি ভুদায় কুত্তার চোদনে ও  রস পরে 🤤💦"+ " " + name, mentions: arraytag})}, 29000);
setTimeout(() => {a({body:"তোর মার গুদে রট ঢুকিয়ে চুদি 😹"+ " " + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body:"তর রসের হাড়ি ভুদায় হাতি দিয়ে চুদামু "+ " " + name, mentions: arraytag})}, 31000);
setTimeout(() => {a({body:"আশা করি ভবিষ্যতে আর আমাদের সাথে লাগতে আসবিনা"+ " " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body:"𝗡𝗮𝗷𝗺𝘂𝗹 এর কন্ডম না আনার ভুলে তোর জন্ম"+ " " + name, mentions: arraytag})}, 33000);
setTimeout(() => {a({body:"তর মুখে মাল ফেলবো  "+ " " + name, mentions: arraytag})}, 34000);
setTimeout(() => {a({body:"তোর আব্বুদের কথা ভুলিস্না জেনো🥱"+ " " + name, mentions: arraytag})}, 35000);

setTimeout(() => {a({body: "তর কালা ভুদায় কুত্তার মাল ফেলবো। 🤢🤮" + " " + name, mentions: arraytag})}, 2000);
}
};
